

# 1.字符串：一种常用的有序但是不可变的容器的数据类型
"""
可以同时存储多个字符，属于序列范畴
字面量：使用单引号或者双引号将任意字符括起来，就是字符串常量

字符：字符串中的每一个单元

字符串的内容：
普通字符：包含数字字符、字母、普通符号.....
转义字符：通过 \ 将一些字符转换成有特殊功能或者特殊意义的字符
      \n: 换行
      \t: 制表符（tab）
      \': 普通单引号
      \\: \
      注意：一个转义字符代表一个字符
阻止转义：在字符串的最前面加 r/R，可以阻止转义字符转义
"""

print(r"sdkjfk\ksdk")

print(2 & 3)
print(-97 | 120)
num = 10 ; t = 20

# gewei = 12345 % 10
# # shiwei = 12345 % 100 // 10
# # baiwei = 12345 % 1000 // 100
# # qianwei = 12345 % 10**4 // 1000
# # wangwei = 12345 % 10**5 // 10**4
# #
# # print(gewei,shiwei,baiwei,qianwei,wangwei)


